{
  "backend/main.mo": "Motoko actor implementing user profile management and contact form submission with role-based access control, restricting profile access to users and form review to admins.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (product card actions, cart, wishlist, checkout, address form) to their corresponding source files and test IDs.",
  "frontend-file-summaries.txt": "JSON dictionary of short summaries for each frontend source file, describing the purpose and key content of every component, hook, and config file.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH CSS custom properties for light and dark color themes used throughout the app.",
  "frontend/index.html": "HTML entry point that sets the page title to 'Melt & Glow' and mounts the React app via the root div.",
  "frontend/src/App.tsx": "Root React component that manages cart, wishlist, and checkout state and passes handlers down to Navigation, Products, Cart, Wishlist, and CheckoutModal components.",
  "frontend/src/components/About.tsx": "About section component displaying the 'It Is My Dream Business' headline, brand story copy referencing Diamond Harbour/Falta, and three stat cards.",
  "frontend/src/components/Cart.tsx": "Slide-out cart drawer component showing cart items with quantity controls, remove buttons, subtotal, and a Proceed to Checkout button.",
  "frontend/src/components/CheckoutModal.tsx": "A multi-step checkout modal (address → payment → success) that collects and validates delivery address, displays a UPI payment ID, and triggers order completion after a success delay.",
  "frontend/src/components/Contact.tsx": "A contact section with owner info (phone, email, social links) and a validated contact form that submits via a React Query mutation hook.",
  "frontend/src/components/Footer.tsx": "Site footer displaying the brand logo, tagline, social media links, smooth-scroll navigation buttons, and owner contact details.",
  "frontend/src/components/Hero.tsx": "Full-screen hero section with a background image, overlay, brand tagline, and CTA buttons for ordering and scrolling to products.",
  "frontend/src/components/Navigation.tsx": "Fixed top navigation bar with smooth-scroll links, a scroll-aware background, and cart/wishlist icon buttons with item count badges, including a mobile menu toggle.",
  "frontend/src/components/Services.tsx": "Products section rendering a grid of four hardcoded candle products with add-to-cart, wishlist toggle, and place-order actions per card.",
  "frontend/src/components/Wishlist.tsx": "A slide-in drawer component that displays the user's wishlist items with product image, name, and price, and supports removing individual items or closing the drawer.",
  "frontend/src/hooks/useActor.ts": "A React Query-based hook that creates and caches an ICP backend actor, using an authenticated identity when available and initializing access control with an admin token from URL params.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider context and useInternetIdentity hook for managing DFINITY Internet Identity authentication, including login, logout, and identity persistence via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Exports a useSubmitContactForm mutation hook that submits a contact form (name, email, message) via the backend actor and invalidates the submissions query on success.",
  "frontend/src/index.css": "Global CSS file that imports Google Fonts, configures Tailwind base/components/utilities, and defines a warm terracotta/sand design token system via CSS custom properties for both light and dark modes.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider into the DOM root.",
  "frontend/src/utils/urlParams.ts": "Utility module providing functions to read URL parameters from query strings or hash-based routes, persist them in sessionStorage, and remove sensitive parameters from the URL without a page reload.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration that extends the theme with custom OKLCH-based color tokens, display/body font families, box shadows, border radii, and registers typography, container-queries, and animate plugins.",
  "project_state.json": "Tracks the project state for an e-commerce candle shop, including existing features (cart, wishlist, place order, UPI payment, address form, business details) and architectural notes. Records schema version, feature IDs, and any new feature requests."
}