{
  "backend/main.mo": "Motoko actor implementing user profile storage and contact form submission with role-based access control, restricting profile access to users and submission viewing to admins.",
  "feature_evidence.json": "Feature evidence report mapping three implemented features (tagline update, contact number update, UPI ID update) to their respective frontend source files and test IDs.",
  "frontend-file-summaries.txt": "JSON document containing one-line summaries of all frontend source files, describing their purpose and key content for build planning reference.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH CSS custom properties for light and dark color themes including background, foreground, accent, chart, and sidebar tokens.",
  "frontend/index.html": "HTML entry point setting the page title to 'Melt & Glow' and mounting the React app via the root div and main.tsx module script.",
  "frontend/src/App.tsx": "Root React component managing cart, wishlist, and checkout state with handlers passed to Navigation, Products, Cart, Wishlist, and CheckoutModal components.",
  "frontend/src/components/About.tsx": "About section component displaying the brand story crediting Arpan Ghosh as creator, Diamond Harbour/Falta location, and three stat cards with icons.",
  "frontend/src/components/Cart.tsx": "Slide-out cart drawer component showing items with quantity controls, remove buttons, subtotal, and a Proceed to Checkout button.",
  "frontend/src/components/CheckoutModal.tsx": "A multi-step checkout modal (address → payment → success) that collects and validates shipping address, displays a UPI payment ID, and triggers order completion after a success delay.",
  "frontend/src/components/Contact.tsx": "A contact section displaying owner info (phone, email, social links) alongside a validated contact form that submits via a React Query mutation hook.",
  "frontend/src/components/Footer.tsx": "Site footer with brand logo, tagline, social media links, smooth-scroll navigation buttons, and contact details for Melt & Glow.",
  "frontend/src/components/Hero.tsx": "Full-screen hero section with a background image, overlay, brand tagline, and CTA buttons for ordering and scrolling to the products section.",
  "frontend/src/components/Navigation.tsx": "Fixed top navigation bar with smooth-scroll links, a mobile hamburger menu, and cart/wishlist icon buttons with item count badges.",
  "frontend/src/components/Services.tsx": "Products section rendering a grid of four hardcoded candle products with add-to-cart, wishlist toggle, and place-order actions per card.",
  "frontend/src/components/Wishlist.tsx": "A slide-in drawer component that displays the user's wishlist items with product image, name, and price, supporting item removal and an empty state with a browse prompt.",
  "frontend/src/hooks/useActor.ts": "A React Query-based hook that creates and caches an ICP backend actor, using an authenticated identity when available or falling back to anonymous, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider context and useInternetIdentity hook for managing DFINITY Internet Identity authentication, including login, logout, and identity persistence via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Exports a useSubmitContactForm mutation hook that submits a contact form (name, email, message) via the backend actor and invalidates the submissions query on success.",
  "frontend/src/index.css": "Global stylesheet that imports Google Fonts, configures Tailwind base/components/utilities, and defines a warm terracotta/sand design token system via CSS custom properties for both light and dark modes.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider into the root DOM element.",
  "frontend/src/utils/urlParams.ts": "Utility module providing functions to read URL parameters from query strings or hash-based routes, persist them in sessionStorage, and remove sensitive parameters from the URL without reloading.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration that extends the theme with custom OKLCH-based color tokens (terracotta, sand, cream), display/body font families, custom shadows, and registers typography, container-queries, and animate plugins.",
  "project_state.json": "Tracks project metadata, existing features, and architectural notes for Arpan Ghosh's handcrafted candle shop, including contact numbers and UPI payment details. Records three completed feature updates related to tagline, contact info, and UPI ID."
}