{
  "backend/main.mo": "Motoko actor defining user profile storage and contact form submission logic, with role-based access control restricting profile reads/writes to users and submission reviews to admins.",
  "feature_evidence.json": "Feature evidence report confirming that the OwnerPhoto floating widget was repositioned to bottom-right (above the WhatsApp button) with its circular photo, glow ring, and name label intact.",
  "frontend-file-summaries.txt": "JSON document containing one-line summaries of every frontend source file, serving as a quick reference for the contents and purpose of each component, hook, and config file.",
  "frontend/index.css": "Tailwind CSS entry file defining OKLCH-based CSS custom properties for light and dark themes, covering background, foreground, card, accent, chart, and sidebar color tokens.",
  "frontend/index.html": "Minimal HTML shell with the page title set to 'Melt & Glow' and a root div that mounts the React app via main.tsx.",
  "frontend/src/App.tsx": "Root React component managing cart, wishlist, and checkout state, composing all page sections (Hero, TrustBadges, About, Products, Contact, Footer) alongside Cart, Wishlist, CheckoutModal, FloatingWhatsApp, and OwnerPhoto overlays.",
  "frontend/src/components/About.tsx": "About section featuring the 'It Is My Dream Business' headline, brand copy crediting Melt & Glow and the MG team, and three stat cards for handcrafted quality, community, and the brand tagline.",
  "frontend/src/components/Cart.tsx": "Slide-out cart drawer with item list, quantity increment/decrement controls, per-item remove buttons, subtotal display, and a Proceed to Checkout button.",
  "frontend/src/components/CheckoutModal.tsx": "A multi-step checkout modal (address → payment → success) that collects and validates shipping address, displays a UPI payment ID, and triggers order completion after a success delay.",
  "frontend/src/components/Contact.tsx": "A contact section with owner info (phone, email, social links) and a validated contact form that submits via a React Query mutation hook.",
  "frontend/src/components/FloatingWhatsApp.tsx": "A fixed floating button linking to the owner's WhatsApp, displayed with the official WhatsApp SVG icon in the bottom-right corner.",
  "frontend/src/components/Footer.tsx": "Site footer with brand info, social media links, smooth-scroll navigation links, and owner contact details laid out in a responsive grid.",
  "frontend/src/components/Hero.tsx": "Full-screen hero section with a background image, overlay, animated tagline, and CTA buttons to open the shop or scroll to products.",
  "frontend/src/components/Navigation.tsx": "Fixed top navigation bar with smooth-scroll links, scroll-aware background, and cart/wishlist icon buttons with item count badges; includes a mobile menu toggle.",
  "frontend/src/components/OwnerPhoto.tsx": "A fixed floating widget in the bottom-right that displays the owner's circular photo with a glow ring and name label.",
  "frontend/src/components/Services.tsx": "Defines a Products component that displays a grid of four handcrafted candle products with add-to-cart, wishlist toggle, and place-order actions.",
  "frontend/src/components/TrustBadges.tsx": "Renders a horizontal strip of four trust badge items (e.g., '100% Handcrafted', 'Home Delivery Available') with checkmark icons.",
  "frontend/src/components/WhyChooseUs.tsx": "Empty file with no content or exports.",
  "frontend/src/components/Wishlist.tsx": "Implements a slide-in drawer component that displays the user's wishlist items with the ability to remove individual products.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, reinitializing it when the user's identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing DFINITY Internet Identity authentication state, including login, logout, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Exports a useSubmitContactForm mutation hook that calls the backend actor's submitContactForm method and invalidates the submissions query on success.",
  "frontend/src/index.css": "Global stylesheet that imports Google Fonts, configures Tailwind, and defines CSS custom properties for a warm sand/terracotta design system with light and dark themes.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped in QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/utils/urlParams.ts": "Utility module providing functions to read, persist, and clear URL parameters from both query strings and hash-based routing, with sessionStorage fallback support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with dark mode, custom color tokens using oklch variables, custom fonts (Playfair Display, Inter), extended shadows, border radii, and plugins for typography, container queries, and animations.",
  "project_state.json": "Tracks project state version 3, recording an existing feature that repositions the OwnerPhoto floating widget to the bottom-right viewport corner above the FloatingWhatsApp button, and a pending new request to do the same."
}