{
  "backend/main.mo": "Motoko actor implementing user profile management and contact form submission with role-based access control, restricting profile access to users and form review to admins.",
  "feature_evidence.json": "Feature evidence report documenting the repositioning of the OwnerPhoto floating widget from bottom-right to top-right viewport corner, referencing OwnerPhoto.tsx as the affected file.",
  "frontend-file-summaries.txt": "JSON document containing one-line summaries of all frontend source files, describing each component's purpose and key UI details for the Melt & Glow candle shop.",
  "frontend/index.css": "Tailwind CSS entry file defining OKLCH-based CSS custom properties for light and dark themes, covering background, foreground, card, accent, chart, and sidebar color tokens.",
  "frontend/index.html": "Minimal HTML shell with the page title set to 'Melt & Glow' and a root div that mounts the React app via main.tsx.",
  "frontend/src/App.tsx": "Root React component managing cart, wishlist, and checkout state, composing all page sections (Hero, TrustBadges, About, Products, Contact) along with Cart, Wishlist, CheckoutModal, FloatingWhatsApp, and OwnerPhoto overlays.",
  "frontend/src/components/About.tsx": "About section featuring the 'It Is My Dream Business' headline, brand copy crediting Melt & Glow and the MG team, and three stat cards for handcrafted quality, community, and brand tagline.",
  "frontend/src/components/Cart.tsx": "Slide-out cart drawer with item list, quantity increment/decrement controls, remove buttons, subtotal display, and a Proceed to Checkout button.",
  "frontend/src/components/CheckoutModal.tsx": "A multi-step checkout modal (address → payment → success) that collects and validates shipping address, displays a UPI payment ID, and triggers order completion after a success delay.",
  "frontend/src/components/Contact.tsx": "A contact section with owner info (phone, email, social links) and a validated contact form that submits via a React Query mutation hook.",
  "frontend/src/components/FloatingWhatsApp.tsx": "A fixed floating button linking to the owner's WhatsApp, displayed with the official WhatsApp SVG icon in the bottom-right corner.",
  "frontend/src/components/Footer.tsx": "Site footer displaying the brand logo, tagline, social media links, navigation buttons, and owner contact details in a responsive grid layout.",
  "frontend/src/components/Hero.tsx": "Full-screen hero section with a background image, overlay, animated headline/tagline, and CTA buttons to shop or scroll to products.",
  "frontend/src/components/Navigation.tsx": "Fixed top navigation bar with smooth-scroll links, cart and wishlist icon buttons with item count badges, and a responsive mobile menu toggle.",
  "frontend/src/components/OwnerPhoto.tsx": "A fixed floating widget showing the owner's circular photo with a glow ring and name label, positioned in the top-right of the viewport.",
  "frontend/src/components/Services.tsx": "Defines and renders a product grid of four handcrafted candles with add-to-cart, wishlist toggle, and place-order actions. Exports a `Products` component that accepts wishlist state and callback props.",
  "frontend/src/components/TrustBadges.tsx": "Renders a horizontal strip of four trust-signal badges (e.g., '100% Handcrafted', 'Home Delivery Available') each with a checkmark icon.",
  "frontend/src/components/WhyChooseUs.tsx": "Empty file with no content or exports.",
  "frontend/src/components/Wishlist.tsx": "Implements a slide-in drawer that displays wishlisted products with remove functionality, and shows an empty-state prompt when the list is empty.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an `InternetIdentityProvider` and `useInternetIdentity` hook that manage DFINITY AuthClient lifecycle, login/logout, and identity state with status tracking.",
  "frontend/src/hooks/useQueries.ts": "Exports a `useSubmitContactForm` mutation hook that calls the backend `submitContactForm` actor method and invalidates the submissions query on success.",
  "frontend/src/index.css": "Global stylesheet that imports Google Fonts, configures Tailwind, and defines CSS custom properties for a warm sand/terracotta design system in both light and dark modes.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped in `QueryClientProvider` and `InternetIdentityProvider`.",
  "frontend/src/utils/urlParams.ts": "Utility module providing functions to read, persist, and clear URL parameters from both query strings and hash-based routes, with sessionStorage fallback for sensitive values like admin tokens.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the Melt & Glow frontend, extending the default theme with custom colors (oklch-based), fonts, shadows, border radii, and keyframe animations, while enabling dark mode and including typography, container-queries, and animate plugins.",
  "project_state.json": "Tracks the current state of the Melt & Glow website project, recording existing features (repositioning the OwnerPhoto widget to the top-right) and a pending new feature request to place the owner photo at the top-right of the site."
}