{
  "kind": "build_request",
  "title": "Update business details: tagline, contact numbers, and UPI payment ID",
  "projectName": "Melt & Glow",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the site tagline/description to 'Handcrafted candles made with love by Arpan Ghosh' wherever brand copy or taglines appear (Hero section, About section, Footer).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Handcrafted candles made with love by Arpan Ghosh"
        ]
      },
      "acceptanceCriteria": [
        "The phrase 'Handcrafted candles made with love by Arpan Ghosh' is visible in the Hero section tagline or subtitle.",
        "The About section and Footer reflect the updated brand copy referencing Arpan Ghosh."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update the primary contact number to 6294577453 and add the alternative contact number 8617376874 in the Contact section, Footer, and any other location where contact details are displayed.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "My Contact number is 6294577453",
          "Another Alternative Number is 8617376874"
        ]
      },
      "acceptanceCriteria": [
        "Primary phone number 6294577453 is displayed in the Contact section and Footer.",
        "Alternative phone number 8617376874 is displayed alongside the primary number in the Contact section and Footer.",
        "Both numbers are clickable tel: links on mobile."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Update the UPI payment ID to '6294577453@ybl' in the CheckoutModal payment step and anywhere else UPI payment details are shown.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "this is my UPI ID 6294577453@ybl for payment"
        ]
      },
      "acceptanceCriteria": [
        "The CheckoutModal payment step displays the UPI ID '6294577453@ybl'.",
        "No other/old UPI ID remains visible in the application."
      ]
    }
  ],
  "constraints": [
    "Do not alter any checkout flow logic, cart, wishlist, or order features.",
    "Do not modify files under frontend/src/hooks/ or frontend/src/components/ui."
  ],
  "nonGoals": [
    "Adding new pages or sections.",
    "Changing the visual theme or color palette.",
    "Backend schema changes."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}